Repository: KDE/kshisen
Catalog: po/*/kshisen.po
Languages: eo, es, ja, zh_cn

# NAME OF TRANSLATORS
source: Your names
eo: Wolfram Diestel,Oliver Kellogg
es: Sofía Priego,Rafael Osuna,Victor Romero,Pablo J. Barneo González,Miguel Revilla Rodríguez,Lucas García,Kira J. Fernández
ja: Taiki Komoda,Takuro Ashie,Kurose Shushi,Naoya KOJIMA
zh_cn: KDE 中国

# EMAIL OF TRANSLATORS
source: Your emails
eo: wolfram@steloj.de,olivermkellogg@gmail.com
es: spriego@darksylvania.net,rafa@ecotelco.com,romero@kde.org,pablob@nikhef.nl,yo@miguelrevilla.com,tanke@escomposlinux.org,kirajfdez@gmail.com
ja: kom@kde.gr.jp,ashie@homa.ne.jp,md81@bird.email.ne.jp,naoya@fullmoon.dyndns.org
zh_cn: kde-china@kde.org

source: Select a tile
eo: Elekti kahelon
es: Selecciona una ficha
ja: 牌を選択してください
zh_cn: 选择一张牌

source: Time: 0:00:00
eo: Tempo: 0:00:00
es: Tiempo: 0:00:00
ja: タイム: 0:00:00
zh_cn: 时间：0:00:00

source: Removed: 0/0
eo: Forigita: 0/0
es: Eliminadas: 0/0
ja: 除去済み: 0/0
zh_cn: 消去：0/0

source: Cheat mode
eo: Trompa reĝimo
es: Modo con trampas
ja: カンニングモード
zh_cn: 作弊模式

source: Play Sounds
eo: Aŭdigi Sonorojn
ja: 効果音あり
zh_cn: 播放声音

source: Gravity
eo: Gravito
es: Gravedad
ja: 重力
zh_cn: 重力

source: Yes
eo: Jes
es: Sí
ja: あり
zh_cn: 是

source: No
eo: Ne
ja: なし
zh_cn: 否

source: You could have been in the high scores if you did not use Undo or Hint. Try without them next time.
eo: Vi povus esti en la altaj poentoj se vi ne uzis Malfari aŭ Sugeston. Provu sen ili venontfoje.
es: Podrías haber estado en las mejores puntuaciones si no hubieras usado la función de deshacer o las pistas. Prueba sin ellas la próxima vez.

source: End of Game
eo: Fino de Ludo
ja: ゲーム終了
zh_cn: 游戏结束

source: Congratulations! You made it into the hall of fame.
eo: Gratulon! Vi eniris la halon de famo.
es: ¡Felicidades! Has conseguido entrar en el cuadro de honor.
ja: おめでとうございます! 殿堂入りを果たしました。
zh_cn: 恭喜！ 您的成绩已经进入了名人堂。

# %1 - time string like hh:mm:ss
source: You made it in %1
eo: Vi faris ĝin en %1
es: Lo has conseguido en %1
ja: タイムは %1 でした。
zh_cn: 您在 %1 内完成了游戏

source: Your time: %1:%2:%3 %4
eo: Via tempdaŭro: %1:%2:%3 %4
es: Tu tiempo: %1:%2:%3 %4
ja: タイム: %1:%2:%3 %4
zh_cn: 您的时间：%1:%2:%3 %4

source: (Paused)
eo: (Paŭzita)
es: (En pausa)
ja: (一時停止)
zh_cn: (暂停)

source: Removed: %1/%2
eo: Forigis: %1/%2
es: Eliminadas: %1/%2
ja: 除去済み: %1/%2
zh_cn: 消去：%1/%2

source: Select a matching tile
eo: Elektu kongruan kahelon
es: Selecciona una ficha coincidente
ja: マッチする牌を選択してください
zh_cn: 选择一张匹配牌

source: Select the move you want by clicking on the blue line
eo: Elektu la movon, kiun vi volas, alklakante la bluan linion
es: Selecciona el movimiento que quieras pulsando en la línea azul
ja: 青い線のいずれかをクリックして手を選択してください
zh_cn: 选择点击蓝线时要移动的牌

source: This tile did not match the one you selected
eo: Ĉi tiu kahelo ne kongruis kun tiu, kiun vi elektis
es: La ficha no coincide con la que has seleccionado
ja: この牌は選択された牌とマッチしていません
zh_cn: 此牌和您选中的不匹配

source: You cannot make this move
eo: Vi ne povas fari ĉi tiun movon
es: No puedes hacer este movimiento
ja: これは取り除けません
zh_cn: 此移动无法进行

source: General
eo: Ĝenerala
ja: 全般
zh_cn: 常规

# %1 is a path to a tile set file
source: An error occurred when loading the default tile set. Please install the KMahjongg library.
eo: Eraro okazis dum ŝargo de la defaŭlta kahelaro. Bonvolu instali la bibliotekon KMahjongg.
es: Ha ocurrido un error al cargar el juego de fichas predeterminado. Instala la biblioteca de KMahjongg.

source: Error Loading Tiles
eo: Eraro Ŝargante Kahelojn
zh_cn: 加载图案失败

# %1 is a path to a tile set file
source: An error occurred when loading the tile set %1. The default tile set has been loaded.
eo: Eraro okazis dum ŝargo de la kahelaro %1. La defaŭlta kahelaro estis ŝargita.
es: Ha ocurrido un error al cargar el juego de fichas %1. Se ha cargado el juego de fichas predeterminado.

# %1 is a path to a tile set file
source: An error occurred when loading the tile set %1. The default tile set could also not be loaded. Please install the KMahjongg library.
eo: Eraro okazis dum ŝargo de la kahelaro %1. La defaŭlta kahelaro ankaŭ ne povus esti ŝargita. Bonvolu instali la bibliotekon KMahjongg.
es: Ha ocurrido un error al cargar el juego de fichas %1. Tampoco se ha podido cargar el juego de fichas predeterminado. Instala la biblioteca de KMahjongg.

# %1 is a path to a background image file
source: An error occurred when loading the default background. Please install the KMahjongg library.
eo: Okazis eraro dum ŝargi la defaŭltan fonon. Bonvolu instali la bibliotekon KMahjongg.
es: Ha ocurrido un error al cargar el fondo predeterminado. Instala la biblioteca de KMahjongg.

# %1 is a path to a background image file
source: An error occurred when loading the background %1. The default background has been loaded.
eo: Eraro okazis dum ŝargo de la fono %1. La defaŭlta fono estis ŝargita.
es: Ha ocurrido un error al cargar el fondo %1. Se ha cargado el fondo predeterminado.

# %1 is a path to a background image file
source: An error occurred when loading the background %1. The default background could also not be loaded. Please install the KMahjongg library.
eo: Eraro okazis dum ŝargo de la fono %1. La defaŭlta fono ankaŭ ne povus esti ŝargita. Bonvolu instali la bibliotekon KMahjongg.
es: Ha ocurrido un error al cargar el fondo %1. Tampoco se ha podido cargar el fondo predeterminado. Instala la biblioteca de KMahjongg.

source: Game Paused Click to resume game.
eo: Ludo Paŭzita Alklaku por rekomenci la ludon.
es: Partida en pausa. Haz clic para continuar la partida.
ja: ゲーム一時停止 クリックで再開します。
zh_cn: 游戏暂停 点击恢复游戏。

source: Game Stuck No more moves possible.
eo: Ludo Blokiĝis Ne eblas pliaj movoj.
es: Juego bloqueado. No hay más movimientos posibles.
zh_cn: 完了 无法再走了。

source: Game Over Click to start a new game.
eo: Game Over Alklaku por komenci novan ludon.
es: Partida terminada. Haz clic para empezar una nueva.
ja: ゲームオーバー クリックで新しいゲームを開始します。
zh_cn: 游戏结束 点击开始新游戏。

source: The tile set to use.
eo: La kahelo estas uzata.
es: El conjunto de fichas que se usará.
ja: 使用する牌セット
zh_cn: 要使用的牌样。

source: The background to use.
eo: La fono por uzi.
es: El fondo que se usará.
ja: 使用する背景画像
zh_cn: 要使用的背景。

source: Main Toolbar
eo: Ĉefa ilobreto
es: Barra de herramientas principal
ja: メインツールバー
zh_cn: 主工具栏

source: A game similar to Mahjongg
eo: Ludo simila al Mahjongg
es: Un juego similar al Mahjongg
zh_cn: 一个类似于麻将的连连看游戏

source: Copyright 1997 Mario Weilguni
eo: Kopirajto 1997 Mario Weilguni
zh_cn: 版权 1997 Mario Weilguni

source: Current Maintainer
eo: Nuna fleganto
es: Responsable actual.
ja: 現在のメンテナ
zh_cn: 当前维护者

source: Former Maintainer
eo: Antaŭa Prizorganto
es: Responsable anterior.
ja: 以前のメンテナ
zh_cn: 前任维护者

source: Original Author
eo: Originala aŭtoro
es: Autor original.
ja: オリジナルの作者
zh_cn: 原作者

source: KMahjonggLib integration for KDE4
eo: KMahjonggLib integriĝo por KDE4
es: Integración de KMahjonggLib para KDE4.
ja: KDE4 のための KMahjonggLib 統合
zh_cn: KDE4 中的 KMahjonggLib 集成

source: Added 'tiles removed' counter<br/>Tile smooth-scaling and window resizing
eo: Aldonita 'kaheloj forigitaj' nombrilo<br/>Kahelo glat-skalado kaj fenestro regrandigo
es: Contador de «fichas eliminadas».<br/>Escalado suave de las fichas y cambio de tamaño de la ventana.
ja: 除去済みカウンターを追加<br/>牌のスムーズスケーリングとウィンドウのリサイズ
zh_cn: 增加“消去的块数”计数<br/>牌面平滑放缩和改变窗口大小

source: Thanks also to everyone who should be listed here but is not!
eo: Dankon ankaŭ al ĉiuj, kiuj devus esti listigitaj ĉi tie sed ne estas!
es: ¡Gracias también a todos los que deberían aparecer aquí aunque no lo estén!
ja: ここに挙げられていないすべての関係者の方々にも感謝します!
zh_cn: 同时感谢没能在此列出的各位朋友！

source: <b>Gravity</b><p>Checking this makes the game even harder: If a tile is removed, all tiles lying above it will fall down one step.</p>
eo: <b>Gravito</b><p>Kontroli ĉi tion faras la ludon eĉ pli malfacila: Se kahelo estas forigita, ĉiuj kaheloj kuŝantaj super ĝi falos malsupren unu ŝtupon.</p>
es: <b>Gravedad</b><p>Al marcarla, el juego se vuelve más complicado: si una ficha se elimina, todas las fichas de su alrededor caen un paso.</p>
ja: <p>重力</p><p>このオプションをチェックするとゲームはより難しくなります。牌を 1 つ取り除くとその上にあるすべての牌が 1 つ下に移動します。</p>
zh_cn: <b>重力</b><p>选中此项会增加游戏难度：只要消去一张牌，所有在它上面的牌都会下降一格。</p>

source: <b>Create solvable games only</b><p>If checked, you will only be presented with games that are possible to solve.</p><p>Note: Even in solvable games you can fail to complete if you remove the tiles in the wrong order.</p>
eo: <b>Kreu nur solveblajn ludojn</b><p>Se markite, oni prezentos al vi nur ludojn solveblajn.</p><p>Noto: Eĉ en solveblaj ludoj oni povas malsukcesi plenumi se vi forigu la kahelojn en malĝusta ordo.</p>
es: <b>Crear solo juegos con solución</b><p>Si se marca, solo se le mostrarán juegos que se puedan resolver.</p><p>Nota: incluso en juegos resolubles, es posible que no completes la partida si eliminas las fichas en el orden incorrecto.</p>
ja: <p>解法のあるゲームのみを生成</p><p>このオプションをチェックすると解法のあるゲームのみを生成します。</p><p>【注意】 解法のあるゲームでも、牌を取り除く順序を間違えるとゲームを終了することができなくなります。</p>
zh_cn: <b>只创建可解的游戏</b><p>如果选中此项，您将要面对的游戏是可解的。</p><p>注意：即使在可解的游戏中，如果您消去牌的顺序错误还是可能无法完成游戏。</p>

source: Create solvable games only
eo: Krei nur solveblajn ludojn
es: Crear solo juegos con solución
ja: 解法のあるゲームのみを作成
zh_cn: 只创建可解的游戏

source: <b>Show message if board can no longer be solved</b><p>Checking this makes the game show a message to abort the game in case there are no possible moves left to win the game.</p>
eo: <b>Montri mesaĝon se tabulo ne plu povas esti solvita</b><p>Kontrolante ĉi tion, la ludo montras mesaĝon por ĉesigi la ludon se ne restas eblaj movoj por gajni la ludon.</p>
es: <b>Mostrar un mensaje cuando el tablero no se puede resolver</b><p>Si marcas esta opción, se mostrará un mensaje para interrumpir la partida en el caso de que ya no queden movimientos posibles para ganarla.</p>
zh_cn: <b>版面无解时显示提醒</b><p>勾选此项确保移动无法赢下游戏后显示消息中止游戏。</p>

source: Show message if board can no longer be solved
eo: Montri mesaĝon se tabulo ne plu povas esti solvita
es: Mostrar un mensaje cuando el tablero no se puede resolver
zh_cn: 版面无解时显示提醒

source: <b>Use Chinese style: any flower match any flower, any season match any season</b><p>Use the traditional rules for matching the tiles. Previous version of the game used to allow only exact tiles matches, which is inconsistent with Mah-jongg rules. It is recommended to keep this option checked.</p>
eo: <b>Uzu ĉinan stilon: ajna floro kongruas kun ajna floro, ajna sezono kongruas kun ajna sezono</b><p>Uzu la tradiciajn regulojn por kongrui la kahelojn. Antaŭa versio de la ludo kutimis permesi nur precizajn kahelajn kongruojn, kio estas malkonsekvenca kun Mah-jongg-reguloj. Oni rekomendas konservi ĉi tiun opcion markita.</p>
es: <b>Usar el estilo chino: cualquier flor coincidirá con cualquier otra flor, cualquier estación coincidirá con cualquier otra estación</b><p>Usar las reglas tradicionales para emparejar las fichas. Las versiones anteriores del juego solo permitían coincidencias exactas de fichas, que se contradicen con las reglas del Mahjongg. Se recomienda mantener esta opción marcada.</p>
ja: <p>絵柄の異なる花牌および季節牌同士をマッチさせる (中国式)</p><p>牌をマッチさせる際に伝統的なルールを用います。以前のバージョンではマージャンのルールに反して完全に一致する牌しか取り除けませんでした。このオプションは有効にしておくことをお勧めします。</p>
zh_cn: <b>使用中国风格：各种花样和各种季节牌之间都可配对</b><p>采用传统的牌匹配规则。上一个游戏版本只允许精确的牌样间相互配对，而这和传统麻将规则不一致。推荐您选中此项。</p>

source: Use Chinese style: any flower match any flower, any season match any season
eo: Uzu ĉinan stilon: ajna floro kongruas kun ajna floro, ajna sezono kongruas kun ajna sezono
es: Usar el estilo chino: cualquier flor coincide con cualquier flor. Cualquier estación coincide con cualquier estación.
ja: 絵柄の異なる花牌および季節牌同士をマッチさせる (中国式)
zh_cn: 使用中国风格：各种花样和各种季节牌之间都可配对

source: <b>Tiles can slide, but you can connect only in 2 lines instead of 3</b><p>This option changes the rules to the point where it almost becomes a completely different game. When it is active, you can only remove the tiles if they can be connected by a line consisting of only two segments instead of the customary three. However, you are allowed to slide the tiles on the board, if the row or column where they are placed has some empty space. To make a sliding move, you have to click on the tile containing the column or row that can slide, and then on the matching tile. If there are two possible sliding moves, you will have to click on one of the two connecting lines to choose your preferred move.</p>
eo: <b>Kaheloj povas gliti, sed vi povas konekti nur en 2 linioj anstataŭ 3</b><p>Ĉi tiu opcio ŝanĝas la regulojn ĝis la punkto, kie ĝi preskaŭ fariĝas tute alia ludo. Kiam ĝi estas aktiva, vi povas forigi la kahelojn nur se ili povas esti kunligitaj per linio konsistanta el nur du segmentoj anstataŭ la kutimaj tri. Tamen, vi rajtas gliti la kahelojn sur la tabulon, se la vico aŭ kolumno kie ili estas metitaj havas iom da malplena spaco. Por fari glitan movon, vi devas klaki sur la kahelo enhavanta la kolumnon aŭ vicon, kiu povas gliti, kaj poste sur la kongruan kahelon. Se estas du eblaj glitaj movoj, vi devos klaki sur unu el la du kunligaj linioj por elekti vian preferatan movon.</p>
es: <b>Las fichas pueden deslizarse, pero puedes conectar solo 2 líneas en lugar de 3</b><p>Esta opción cambia las reglas hasta el punto de convertirlo en un juego diferente. Cuando se activa, solo podrás eliminar fichas si se pueden conectar con una línea de dos segmentos en un lugar de tres. Sin embargo, podrás deslizar las fichas por el tablero si la fila o la columna donde están situadas tiene un espacio vacío. Para realizar un deslizamiento, debes pulsar en la ficha que contenga la columna o fila que pueda deslizarse y, a continuación, en la ficha coincidente. Si se pueden realizar dos deslizamientos, debes pulsar en una de las dos líneas de conexión para elegir el que quieras.</p>
ja: <p>牌をスライドする</p><p>このオプションを有効にするとルールが大きく変わって全く別のゲームのようになります。これを有効にすると、通常の 3 本ではなく 2 本の線で結べる場合にしか牌を取り除けません。その代わりに、牌のある縦または横の列に空きがあれば、ボード上で牌をスライドさせることができます。牌をスライドさせるには、まずスライド可能な列の牌をクリックし、次にマッチさせる牌をクリックします。可能な手が 2 つある場合は、牌を結ぶ 2 つの線のいずれかをクリックして手を選択します。</p>
zh_cn: <b>使牌可以滑动，但您只能在 2 条线以内连接牌而不是 3 条</b><p>此选项会更改牌点连接的规则，使其几乎变成另一种全然不同的游戏。启用此项后，您在连接牌时只能用一条包含两个节段的连接线，而不是通常的三段。然而，版面上的牌可以滑动，前提是牌所在的行或列有空余。要实行滑动，您需要在有空余的行或列上点击一张牌，如果存在以上两种可能的滑动方式，您就可以点击其中之一完成您想要的滑动。</p>

source: Tiles can slide, but you can connect only in 2 lines instead of 3
eo: Kaheloj povas gliti, sed vi povas konekti nur en 2 linioj anstataŭ 3
es: Las fichas se pueden deslizar, pero podrás conectar solo 2 líneas en lugar de 3
ja: 牌をスライドする (ただし 3 本ではなく 2 本の線で結ぶ)
zh_cn: 牌可滑动，但您只能在 2 条线以内连接牌而不是 3 条

source: <b>Board Difficulty</b><p>The slider controls the difficulty of the board from Easy to Hard.</p>
eo: <b>Tabulmalfacilaĵo</b><p>La glitilo kontrolas la malfacilecon de la tabulo de Facila al Malfacila.</p>
es: <b>Dificultad del tablero</b><p>Los deslizadores controlan la dificultad del tablero de «Fácil» a «Difícil».</p>
ja: <p>ボードの難易度</p><p>スライダーを使って簡単〜難しいの中からボードの難易度を選択します。</p>
zh_cn: <b>版面难度</b><p>此滑动条从易到难控制版面的游戏难度。</p>

source: Board Difficulty
eo: Tabula Malfacilo
es: Dificultad del tablero
ja: ボードの難易度
zh_cn: 版面难度

source: Easy
eo: Facila
es: Fácil
ja: 簡単
zh_cn: 简单

source: Hard
eo: Malfacila
es: Difícil
ja: 難しい
zh_cn: 困难

source: <b>Piece Removal Speed</b><p>Adjusting this slider alters the speed at which the pieces are removed from the screen after a match has been made.</p>
eo: <b>Rapideco de Forigo de Pecoj</b><p>Alĝustigi ĉi tiun glitilon ŝanĝas la rapidecon je kiu la pecoj estas forigitaj de la ekrano post kiam kongruo estas farita.</p>
es: <b>Velocidad de eliminación de las fichas</b><p>El ajuste de este deslizador modifica la velocidad a la que las fichas se eliminarán de la pantalla después de haberlas emparejado.</p>
ja: <p>牌を消す速度</p><p>スライダーを使ってマッチさせた牌をスクリーンから消す速度を調整します。</p>
zh_cn: <b>消掉块的速度</b><p>调整在完成一次匹配后，牌块从屏幕上消失的速度。</p>

source: Piece Removal Speed
eo: Peco Forigo Rapido
es: Velocidad de eliminación de las fichas
ja: 牌を消す速度
zh_cn: 消掉块的速度

source: Slow
eo: Malrapida
es: Lenta
ja: 遅い
zh_cn: 慢

source: Fast
eo: Rapida
es: Rápida
ja: 速い
zh_cn: 快

source: <b>Board Size</b><p>This slider allows you to change the number of tiles on the board. The more tiles you have, the harder (and longer) the game will be.</p>
eo: <b>Tabulgrando</b><p>Ĉi tiu glitilo permesas ŝanĝi la nombron da kaheloj sur la tabulo. Ju pli da kaheloj vi havas, des pli malfacila (kaj pli longa) estos la ludo.</p>
es: <b>Tamaño del tablero</b><p>Este deslizador permite cambiar el número de fichas del tablero. Cuantas más fichas tenga, más complicada (y larga) será la partida.</p>
ja: <p>ボードのサイズ</p><p>スライダーを使ってボードの牌の数を変更します。牌の数を多くするほどゲームは難しくなり、時間も長くかかります。</p>
zh_cn: <b>牌面大小</b><p>此滑动条允许您更改版面上的牌的大小。牌越多，游戏就越难。</p>

source: Board Size
eo: Ludtabula Grandeco
es: Tamaño del tablero
ja: ボードのサイズ
zh_cn: 牌面大小

# @option:check
source: Play Sounds
es: Reproducir sonidos

# @title:window
source: End of Game
es: Fin de la partida

# @title:window
source: Error Loading Tiles
es: Error al cargar las fichas

source: You could have been in the highscores if you did not use Undo or Hint. Try without them next time.
zh_cn: 如果您不使用撤销或提示， 高分榜才会收录您的名字。 下次不妨试着不要用这些。

source: Shisen-Sho
zh_cn: 连连看
